package enjoyor.enjoyorzemobilehealth.utlis;

/**
 * Created by admin on 2017/6/8.
 */

public class Constant {
    /**
     *
     */
    public static String IS_COMMIT = "iscommit";//是否保存
    public static String ADD = "add";//新增
    public static String UPDATA = "updata";//修改
    public static String USERID = "userid";

    public static String PASSWORD = "password";

    public static String BQMC = "brzyid";//病区名称
    public static String BRZYID = "brzyid";//病人住院id
    public static String BRNAME = "brname";//病人名字
    public static String PGRNAME = "pgrname";//评估人名字
    public static String BRCWH = "brcwh";//病人床位号
    public static String RYSJ = "rusj";//病人入院时间
    public static String BRID = "brid";//病人ID
    public static String SEX = "sex";//病人性别
    public static String AGE = "age";//病人年龄
    public static String BQID = "bqid";//病人年龄
    public static String TAG = "tag";//标识
    /**
     *
     */
    public static int PORT = 5000;//端口号

    /**
     * 危险评估方法
     */
//    public static String DANGER="0700776";
    //1、获取数据
    public static String DANGER = "0700772";
    //2、提交
    public static String DANGER_COMMIT = "0700770";
    //3、修改
    public static String DANGER_UPDATA = "0700771";
    //4、提醒时间
    public static String DANGER_TIME = "0700800";
    //5\删除
    public static String DANGER_DEL = "0700773";
    public static String YACHUANG = "{\"tag\":\"0\",\"type\":\"yachuang\",\"result\":[{\"title\":\"感觉\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全受限\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"非常受限\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"轻度受限\",\"sorce\":\"3分\"},\n" +
            "   {\"name\":\"没有改变\",\"sorce\":\"4分\"}\n" +
            "    ]\n" +
            "    },\n" +
            "   {\"title\":\"潮湿\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"持久潮湿\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"非常潮湿\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"偶尔潮湿\",\"sorce\":\"3分\"},\n" +
            "   {\"name\":\"很少潮湿\",\"sorce\":\"4分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"活动能力\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"卧床不起\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"局限于轮椅\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"偶尔行走\",\"sorce\":\"3分\"},\n" +
            "   {\"name\":\"经常步行\",\"sorce\":\"4分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"移动能力\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全受限\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"严重受限\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"轻度受限\",\"sorce\":\"3分\"},\n" +
            "   {\"name\":\"不受限\",\"sorce\":\"4分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"营养情况\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"重度摄入不足\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"可能摄入不足\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"摄入适当\",\"sorce\":\"3分\"},\n" +
            "   {\"name\":\"摄入良好\",\"sorce\":\"4分\"}\n" +
            "    ]},\n" +
            "   {\n" +
            "   \"title\":\"摩擦/剪力\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"已成为问题\",\"sorce\":\"1分\"},\n" +
            "   {\"name\":\"有潜在问题\",\"sorce\":\"2分\"},\n" +
            "   {\"name\":\"无明显问题\",\"sorce\":\"3分\"}\n" +
            "    ]\n" +
            "    }]\n" +
            "    }";

    public static String ADL = "{\"tag\":\"0\",\"type\":\"adl\",\"result\":[{\"title\":\"进食\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"0分\"}\n" +
            "    ]\n" +
            "    },\n" +
            "   {\"title\":\"洗澡\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"修饰\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"穿衣\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"控制大便\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"可控制\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"偶尔失控\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"完全失控\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"控制小便\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"可控制\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"偶尔失控\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"完全失控\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"如厕\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"床椅转移\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"15分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"完全依赖\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"平地行走\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"15分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"完全依赖\",\"sorce\":\"0分\"}\n" +
            "    ]},\n" +
            "   {\"title\":\"上下楼梯\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"完全独立\",\"sorce\":\"10分\"},\n" +
            "   {\"name\":\"需部分帮助\",\"sorce\":\"5分\"},\n" +
            "   {\"name\":\"需极大帮助\",\"sorce\":\"0分\"}\n" +
            "    ]\n" +
            "    }]\n" +
            "    }";
    public static String ZIPING = "{\"tag\":\"0\",\"type\":\"ziping\",\"result\":[{\"title\":\"部位\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"H=头\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"N=颈\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"C=胸\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"B=乳房\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"S=腹部\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"W=腰\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"BU=臀部\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"G=阴部\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"SH=肩\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"UA=上臂\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"F=前臂\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"HA=手\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"T=大腿\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"CA=小腿\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"A=踝\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"FO=脚\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"O=其他\",\"sorce\":\" \"}\n" +
            "    ]\n" +
            "    },\n" +
            "   {\"title\":\"性质\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"TH=跳痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"PR=压迫痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"D=钝痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"S=锐痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"SH=刺痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"P=牵拉痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"B=烧灼痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"R=放射痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"Dp=隐痛\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"O=其他\",\"sorce\":\" \"}\n" +
            "    ]},\n" +
            "   {\"title\":\"伴随症状\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"N=恶心\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"V=呕吐\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"C=便秘\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"Cf=(意识)模糊\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"A=焦虑\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"I=瘙痒\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"T=抽搐\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"S=大汗淋漓\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"BV=视力模糊\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"H=幻觉\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"BL=便血\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"D=口干\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"O=其他\",\"sorce\":\" \"}\n" +
            "    ]},\n" +
            "   {\"title\":\"疼痛规律\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"C=持续性的\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"I=间歇性的\",\"sorce\":\" \"}\n" +
            "    ]},\n" +
            "   {\"title\":\"药物治疗\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"A=有\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"B=无\",\"sorce\":\" \"}\n" +
            "    ]},\n" +
            "   {\"title\":\"物理治疗\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"RP=复位术\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"H=热疗\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"C=冷敷\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"M=按摩\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"O=其他\",\"sorce\":\" \"}\n" +
            "    ]},\n" +
            "   {\"title\":\"引导治疗\",\n" +
            "   \"bean\":[\n" +
            "   {\"name\":\"D=分散注意力\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"GT=引导想象\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"R=休息\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"E=锻炼\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"S=睡眠\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"RT=放松技巧\",\"sorce\":\" \"},\n" +
            "   {\"name\":\"O=其他\",\"sorce\":\" \"}\n" +
            "    ]\n" +
            "    }]\n" +
            "    }";

    public static final String FALL = "{\"tag\":\"1\",\"type\":\"fallbed\",\"result\":[{\"title\":\"年龄\",\"bean\":[\n" +
            "              {\"name\":\"＞6月，＜3岁\",\"sorce\":\"4分\"},\n" +
            "              {\"name\":\"≥3岁,＜7岁\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"≥7岁,＜13岁\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"≤6月或≥13岁\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"性别\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"男性\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"女性\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"诊断\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"神经系统诊断\",\"sorce\":\"4分\"},\n" +
            "              {\"name\":\"氧和功能改变\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"心理/行为疾病\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"其他诊断\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"环境\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"有跌倒使\",\"sorce\":\"4分\"},\n" +
            "              {\"name\":\"＜3岁，有辅助装置\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"≥3岁，卧床\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"门诊患儿\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"手术麻醉\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"在24小时内\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"在48小时内\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"超过48小时或没有\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"药物（镇静剂、安眠药、巴比妥酸盐、吩噻嗉类、抗抑郁剂、泻药/利尿剂、毒品）\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"以上两种或更多的药物\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"以上药物中的一种\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"其他药物/没有\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"认知\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"认知受损，完全无防跌倒意识\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"认知受损，但有防跌倒意识\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"认知能力正常\",\"sorce\":\"1分\"}\n" +
            "               ]}]\n" +
            "               }";
    public static final String JINGMOXUESHUAN = "{\"tag\":\"1\",\"result\":[" +
            "              {\"title\":\"5分\",\"bean\":[\n" +
            "              {\"name\":\"脑卒中(1个月内)\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"急性脊髓报损(瘫痪)(1个月内)\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"选择性下肢关节置换术\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"髋关节、骨盆或下肢骨折\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"多发性创伤(1个月)\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"大手术(超过3h)\",\"sorce\":\"5分\"}\n" +
            "               ]},\n" +
            "{\"title\":\"1分\",\"bean\":[\n" +
            "              {\"name\":\"年龄41-60岁\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"小手术(＜45分钟)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"肥胖(BMI＞25kg/㎡)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"异常妊娠\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"妊娠期或产后(1个月)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"口服避孕药或使用雌激素\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"需要卧床休息的患者\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"肠炎病史\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"下肢水肿\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"静脉曲张\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"严重肺部疾病(1个月内)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"肺功能异常,COPO\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"急性心肌梗塞(1个月内)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"充血性心力衰竭(1个月内)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"败血症(1个月内)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"大手术史(1个月内)\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"其他高危因素\",\"sorce\":\"1分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"2分\",\"bean\":[\n" +
            "              {\"name\":\"年龄61-74岁\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"石膏固定(1个月内)\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"卧床(＞72)\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"恶性肿瘤(既往或现患)\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"中心静脉置管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"大手术(＞45分钟)\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"腹腔镜手术(＞45分钟)\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"3分\",\"bean\":[\n" +
            "              {\"name\":\"年龄≥75岁\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"VTE病史\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"VTE家族史\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"肝素引导的血小板减少症\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"其他先天性或获得性易栓症\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"抗心磷脂抗体阳性\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"凝血酶原20210A阳性\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"因子V Leiden阳性\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"狼疮抗凝物阳性\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"血清同型半胱氨酸升高\",\"sorce\":\"3分\"}\n" +
            "               ]}]\n" +
            "               }";
    public static final String TAPING = "{\"tag\":\"1\",\"type\":\"taping\",\"result\":[{\"title\":\"面部表情\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"无表情或笑容\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"偶尔出现表情或皱眉,不感兴趣,冷漠\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"频繁出现下颌抽动,牙关紧闭\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\"title\":\"腿\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"正常姿势或放松\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"不安,紧张\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"蜷曲,来回移动\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"活动\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"安静平躺,姿势、活动正常\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"不安,来回移动,紧张\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"踢腿,僵硬或痉挛\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"哭叫\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"不哭(醒或处于睡眠状态)\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"呻吟,呜咽,偶尔哭诉\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"持续哭泣,尖叫、频繁出现哭诉\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"安抚\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"安静,放松\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"触摸,拥抱或讲话、转移注意力可安抚\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"安慰、安抚不止\",\"sorce\":\"2分\"}\n" +
            "               ]}]\n" +
            "               }";
    public static final String CHILDPAIN = "{\"tag\":\"1\",\"result\":[{\"title\":\"面部表情\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"放松\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"紧张、皱眉或淡薄\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"经常或一直皱眉扭曲，紧咬\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\"title\":\"下肢状态\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"安静\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"紧张，不安静\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"腿踢动或腿部卷曲\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"活动\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"静卧或活动自如\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"躁动\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"身体曲直、僵直或急扭\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"安抚效果\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"不需要安抚\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"可安抚\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"很难安抚\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"通气依从性（气管插管患儿）\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"完全忍受\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"呛咳，但能忍受\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"对抗呼吸机\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\n" +
            "              \"title\":\"哭闹（非气管插管患儿）\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"无异常发声\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"呻吟，呜咽偶哭\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"持续哭，哭声大\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               }]\n" +
            "               }";
    public static final String ADULTPAIN = "{\"tag\":\"1\",\"result\":[{\"title\":\"面部表情\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"放松\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"紧张、皱眉或淡薄\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"经常或一直皱眉扭曲，紧咬\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\"title\":\"休息状态\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"安静\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"有时休息不好交换体位\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"长时间休息不好，频繁交换体位\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"肌张力\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"放松\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"增加\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"僵硬，手指或脚趾屈曲\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"安抚效果\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"不需要安抚\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"通过分散注意力能安抚\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"通过分散注意力很难安抚\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"通气依从性（气管插管患者）\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"完全忍受\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"呛咳，但能忍受\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"对抗呼吸机\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\n" +
            "              \"title\":\"发声（非气管插管患者）\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"无异常发声\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"有时呻吟哭泣\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"频繁，或持续呻吟，哭泣\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               }]\n" +
            "               }";
    public static final String UNPLAN = "{\"tag\":\"1\",\"type\":\"unplan\",\"result\":[{\"title\":\"年龄\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"≥70岁\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"＜5岁\",\"sorce\":\"1分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\"title\":\"高危导管(Ⅰ类导管)\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"气管插管/切开\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"脑室引流管\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"心包引流管\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"胸腔引流管\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"T管引流管\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"动静脉插管\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"转科高危导管\",\"sorce\":\"5分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"非高危导管(Ⅱ类导管)\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"导尿管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"鼻胃(肠)管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"盆/腹引流管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"胃肠减压管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"深静脉置管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"PICC\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"造瘘管\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"其他专科非高危导管\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" + "   " +
            "               {\"title\":\"意识状态\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"烦躁/嗜睡/谵妄/意识模糊/精神障碍\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"患者对置管受耐性差\",\"sorce\":\"5分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"管路刀口\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"专科未缝线固定\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"粘贴固定局部多汗,渗血或分泌物多\",\"sorce\":\"2分\"}\n" +
            "               ]}]\n" +
            "               }";
    public static final String FALLBED = "{\"tag\":\"0\",\"type\":\"fallbed\",\"result\":[{\"title\":\"年龄\",\"bean\":[\n" +
            "              {\"name\":\"≥65\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"≥75\",\"sorce\":\"2分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\n" +
            "              \"title\":\"既往史\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"无\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"癫痫/晕厥史\",\"sorce\":\"6分\"}\n" +
            "               ]\n" +
            "               },\n" +
            "              {\"title\":\"意识状态\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"无\",\"sorce\":\"0分\"},\n" +
            "              {\"name\":\"意识障碍\",\"sorce\":\"6分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"感官因素\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"听觉障碍\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"视觉障碍\",\"sorce\":\"3分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"使用药物\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"降压药\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"利尿药\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"中枢性镇痛药\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"导泻药\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"降糖药\",\"sorce\":\"1分\"},\n" +
            "              {\"name\":\"镇静安眠药\",\"sorce\":\"2分\"}\n" +
            "               ]},\n" +
            "              {\"title\":\"疾病因素\",\n" +
            "              \"bean\":[\n" +
            "              {\"name\":\"肢体活动受限\",\"sorce\":\"5分\"},\n" +
            "              {\"name\":\"体质虚弱\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"便秘/腹泻\",\"sorce\":\"2分\"},\n" +
            "              {\"name\":\"中、重贫血\",\"sorce\":\"3分\"},\n" +
            "              {\"name\":\"眩晕\",\"sorce\":\"6分\"}\n" +
            "               ]}\n" +
            "                   ]\n" +
            "               }";
}
